<a href="https://colab.research.google.com/github/MinMolang/codePractice/blob/master/%EB%B0%95%EB%AF%BC%EC%A7%80_4%EC%A3%BC%EC%B0%A8_Python.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## 4주차 - Python 과제

코드 실행시 SyntaxError 가 발생하면 0점으로 배점합니다. 문제 요구사항을 모두 구현하지 못하셔도 작동되는 코드를 작성해주시기 바랍니다.

### 1. 클래스 생성하기
(10 점)

#### 참고사항
아래에 설명 드리는 내용중 **한글단어(eng)** 처럼 작성된 내용중에 영문 표기는 **클래스명** **함수명** 또는 **변수명** 으로 사용하시면 됩니다. 

#### 클래스 작성 방법

계산기에서 더하기(add), 빼기(sub), 곱하기(mul), 나누기(div) 기능을 가진 계산기 클래스 (Calculator) 를 만들려고 합니다.
사용자로부터 첫번째 숫자(num1), 두번째 숫자(num2) 로 특정한 이름 (여기에서는 first 를 사용) 객체를 만들면 위 4가지 기능(더하기, 빼기, 곱하기, 나누기) 를 사용할 수 있게 작성해주시면 됩니다.

## O

In [ ]:
# 여기에 Class 를 작성해주세요.
class Calculator:
  """
  calculate two numbers (add, sub, mul, div) Class
  """
  def __init__(self, num1, num2):
    self.num1 = num1
    self.num2 = num2

  def add(self):
    return self.num1 + self.num2
  
  def sub(self):
    return self.num1 - self.num2
  
  def mul(self):
    return self.num1 * self.num2
  
  def div(self):
    return self.num1 / self.num2

In [ ]:
# 실행 결과 예 - div() 대신 다른 기능도 사용해보세요.
first = Calculator(100, 200)
first.div(), first.add(), first.sub(), first.mul()

(0.5, 300, -100, 20000)

### 2. 객체에 있는 total 변수값 직접 수정 방지하기
(10 점)

아래는 add() 를 통해 숫자를 입력받으며 이를 누적하여 더해주는 기능을 하는 클래스 입니다.
객체에 있는 total 값을 외부에서 바로 접근하여 수정하지 못하도록 코드를 수정해주세요.

## O

In [ ]:
# 아래는 계산기(Calc) 클래스 입니다. 위 문제에서 요구하는대로 코드를 수정하여 완성해주세요.

class Calc:
  def __init__(self):
    self.__total = 0

  def getter(self):
    return self.__total
  
  def setter(self, total):
    self.__total = self.__total

  def add(self, num):
    self.__total += num
    return self.__total
  
  total = property(getter, setter)

In [ ]:
# 아래는 테스트코드 및 결과 예 입니다.
# 아래와 같이 total 에 직접 값을 넣어도 total 숫자값이 변경되지 않도록 해주세요.

calc = Calc()
calc.total = 200
calc.total

0

### 3. is a 형태로 동물(Animal) / 인간(Human) 클래스 만들기
(10 점)

아래 '클래스 작성 안내' 를 읽고 is a 형태의 클래스를 작성해주세요.

#### 클래스 작성 안내
- 동물(```Animal```) 클래스엔 걷는시간(```walk_time```), 잠자는시간(```sleep_time```) 변수를 추가해주세요.
- 인간(```Human```) 은 동물(```Animal```) 로 부터 상속 받아주는 코드를 작성해주세요.
- 인간(```Human```) 은 말하다(```speak```) 라는 고유의 기능(method) 을 작성해주세요. 이 기능은 걷는시간(```walk_time```), 잠자는시간(```sleep_time```) 를 출력하는 기능(```print()``` 사용) 을 구현해주세요.

## O

In [ ]:
# 여기에 is a 형태로 작성해주세요.
class Animal:
  """
  Animal class who has a variable (walk_time, sleep_time)
  """
  def __init__(self, walk_time, sleep_time):
    self.walk_time = walk_time
    self.sleep_time = sleep_time

class Human(Animal):
  def speak(self):
    print(f'저는 {self.walk_time} 시간 걸었고, {self.sleep_time} 시간 잠을 잤습니다.')

In [ ]:
# 아래는 결과 예 입니다. print() 내용은 반드시 아래와 동일한 형태가 아니어도 됩니다!
first = Human(10, 20)
first.speak()

저는 10 시간 걸었고, 20 시간 잠을 잤습니다.

### 4. has a 
(10 점)

컴퓨터(Computer) 클래스의 인스턴스가 생성될때 CPU(Cpu), RAM(Ram) 클래스의 인스턴스도 생성되게 코드를 작성해주세요.

#### 작성 안내
- CPU(Cpu) 에는 속도(speed) 변수를 추가해주세요.
- RAM(Ram) 에는 크기(size) 변수를 추가해주세요.
- 컴퓨터(Computer) 클래스엔 com_info 라는 고유의 기능(method) 를 추가하시고 print() 를 통해 CPU, RAM 의 값을 출력해주세요.

## O

In [ ]:
# 여기에 has a 형태로 작성해주세요.
class Cpu:
  def __init__(self, speed):
    self.speed = speed
class Ram:
  def __init__(self, size):
    self.size = size

class Computer:
  def __init__(self, cpu_obj, ram_obj):
    self.cpu = cpu_obj
    self.ram = ram_obj
  
  def com_info(self):
    print(f'CPU 속도 : {self.cpu.speed} Ghz, RAM 크기 : {self.ram.size}GB')

In [ ]:
# 출력 예
speed = Cpu("3.1 Ghz")
size = Ram("32GB")
first_com = Computer(speed, size)
first_com.com_info()

CPU 속도 : 3.1 Ghz Ghz, RAM 크기 : 32GBGB

### 5. 예외처리 
(10점)

menu() 에 음식(food) 를 입력하면 함수 내부에 foods 딕셔너리에 있는 key 를 찾아 음식 가격을 반환하는(return) 기능을 구현하였습니다.

foods 에 없는 음식이면 "메뉴에 없는 음식입니다." 라는 메시지가 출력되게 함수를 수정해주세요.

#### 참고사항
기본적으로 제공되는 예외(exception) 에 대하여 아래 웹사이트를 참고하셔도 좋습니다.

https://docs.python.org/3.6/library/exceptions.html#exception-hierarchy

## O

In [ ]:
# 아래 함수를 수정하여 완성해주세요.
def menu(food):
  foods = {"짜장면": 5000, "탕수육": 10000, "짬뽕": 6000, "볶음밥": 6000}
  try:
    cost = foods[food]
    return cost
  except:
    if food not in foods:
      print("메뉴에 없는 음식입니다.")

In [ ]:
# 실행 결과 예
menu("짜장면")

5000

In [ ]:
menu("깐풍기")

메뉴에 없는 음식입니다.

### 6. (이론) 상관계수
(5 점)

상관계수에 대해 간략하게 작성해주세요.

## O

두 개의 다른 확률변수가 얼마나 관계가 있는지 수치화하여 알아보는 것

* 공분산의 한계를 극복하기 위해 만들어짐 (공분산의 한계 : 표본 데이터 scale에 따라 수치가 달라짐)
* ~1~1까지의 수를 가지며 0과 가까울수록 상관도가 적음
* x의 분산과 y의 분산을 곱한 결과의 제곱근을 나눠주면 x나 y의 변화량이 클수록 0에 가까워짐

### 7. (이론) 분산
(5 점)

분산에 대해 간략하게 작성해주세요.

## O

평균에서 얼마나 멀리 떨어져 있는지에 대한 정도를 알아보기 위한 수치


*   1개의 이산정도를 나타냄
*   편차제곱의 평균

### 8. (이론) 공분산
(5 점)

공분산에 대해 간략하게 작성해주세요.

## O



*   2개의 확률 변수의 상관정도를 나타냄
*   평균 편차곱
*  증가할 때, 같이 증가하는지, 감소하는지에 대한 방향성은 보여줄 수 있으나 강도를 나타내는 데 한계가 있다.
* 표본 데이터의 크기에 따라서 값의 차이가 큰 단점이 있다.

### 9. NumPy 로 최대값, 최소값 가져오기
(5 점)

아래 NumPy array 에서 최대값과 최소값을 출력하는 코드를 작성해주세요.

## O

In [ ]:
import numpy as np
n = np.array([10, 2, 3, 7])

In [ ]:
# 답
print(f'최대값 : {np.max(n)}')
print(f'최소값 : {np.min(n)}')

최대값 : 10
최소값 : 2

In [ ]:
# 출력 예

### 10. NumPy 로 로또번호 생성하기
(10 점)

NumPy 패키지에 있는 랜덤 기능을 활용하여 로또번호(1~45 중 랜덤) 를 6게임을 생성하는 코드를 작성해주세요. 이 문제에서 랜덤 숫자가 중복 생성되는 문제는 무시하셔도 됩니다.

## O

In [ ]:
# 여기에 NumPy 코드를 작성해주세요.
import numpy as np
np.random.seed(3)
np.random.randint(1,46,(5,6))

array([[43, 25,  4,  9,  1, 22],
       [20, 11, 44, 42, 11, 22],
       [39, 33, 21, 45, 30, 40],
       [15, 27, 18, 27, 23,  3],
       [ 3,  2, 27,  6, 41, 34]])

In [ ]:
# 출력 예

array([[ 1,  7, 17, 24, 11, 15],
       [23, 28, 32, 26, 19, 38],
       [29, 33, 33, 45, 21, 42],
       [22, 39, 27, 33, 28, 35],
       [33, 44,  6, 43, 44, 22]])

### 11. DataFrame 특정 행 값 출력하기
(10 점)

아래 DataFrame 에서 3번째 행 을 출력하는 코드를 작성해주세요.

## O

In [ ]:
import pandas as pd

df = pd.DataFrame({
    'Name': ['Huh', 'Jo', 'Park', 'Maeng'],
    'Date': [pd.Timestamp('20130102'), pd.Timestamp('20170612'), pd.Timestamp('20180311'), pd.Timestamp('20191022')],
    'Email': ['huh@gmail.com', 'jojo@daum.net', 'park@naver.com', 'maeng@hotmail.com'],
    'Score': [70, 99, 66, 43]
                                                                   
})
df

    Name       Date              Email  Score
0    Huh 2013-01-02      huh@gmail.com     70
1     Jo 2017-06-12      jojo@daum.net     99
2   Park 2018-03-11     park@naver.com     66
3  Maeng 2019-10-22  maeng@hotmail.com     43

In [ ]:
# 여기에 코드를 작성해주세요.

df.loc[2]

Name                    Park
Date     2018-03-11 00:00:00
Email         park@naver.com
Score                     66
Name: 2, dtype: object

In [ ]:
# 출력 예

Name                    Park
Date     2018-03-11 00:00:00
Email         park@naver.com
Score                     66
Name: 2, dtype: object

### 12. 누적 Quiz 점수 평균 내기
(10 점)

아래 "A" 와 "B" 학생의 누적 점수 입니다. Name 컬럼을 기준으로 두 명의 점수를 각각 평균내는 코드를 작성해주세요.

(힌트 : groupby)

## O

In [ ]:
import pandas as pd
score_dict = {
  "Name": ["A", "B", "B", "A", "A", "A", "B"],
  "Score": [30, 60, 70, 40, 80, 20, 75]
}
df_score = pd.DataFrame(score_dict)
df_score

  Name  Score
0    A     30
1    B     60
2    B     70
3    A     40
4    A     80
5    A     20
6    B     75

In [ ]:
# 여기에 코드를 작성해주세요.
df_score_mean = df_score.groupby('Name').agg('mean').reset_index()
df_score_mean

  Name      Score
0    A  42.500000
1    B  68.333333

In [ ]:
# 결과 예
df_score_mean

  Name      Score
0    A  42.500000
1    B  68.333333